[
    {    "catgory":"Jewelry",
        "Name":"Kadrun Nisha",
        "Email":"kadrunnisha2@gmail.com",
        "image":"/image/m1.jpeg",
        "heading":" received a vintage Cartier Trinity ring",
        "content":"As I mentioned back in my March 2024 Recap, I received a vintage Cartier Trinity ring from my family as a birthday present.  It has since replaced my engagement ring and wedding ring stack, and is the one ring I wear at all times.And since I love this ring so much I thought I would do a quick review of it.The Trinity ring that I got was a secondhand one from Brandear on eBay and it’s actually from the les must de Cartier line that was produced from the 1970’s-80’s.  It was marketed as their more affordable line compared to their usual products (sort of like a diffusion line I think).  When it came to watches, it was a big difference in the materials used (gold vs. gold vermeil), but as far as I can tell for the Trinity rings the only difference is the logo that’s written on the band (Cartier vs. les must de Cartier).  The rings themselves are still made of 18k solid gold just like the current ones.Currently the classic Trinity ring retails for $1960+tax, which is a lot for a fairly simple gold 3-band design.  The one I got secondhand was priced at just under $700.  This vintage one also came with a small vintage box and I could feel the love and care that the previous owner took with this ring.  In the last 5 months, I’ve worn it nonstop and have added more scratches to this ring than all of the 40 years the previous owner had it.  And I’m ok with that since it was purchased waaaaay under retail.",
        "Comments":[
            {
                "a": "Nice one"
    
            },
            {
                "a": "Better choice"
            }
            
        ]
    },
    {    "catgory":"Bags",
        "Name":"Nisha",
        "Email":"nisha2@gmail.com",
        "image":"/image/m2.jpeg",
        "heading":"Thinks I no need Longer",
        "content":"Every month I recap all the things I purchase (lately it’s been a lot of bags), so you would think I’m a reckless big spender (which is kind of true when it comes to bags).  But I realize I never talk about all the things I’m not buying.  And I’m no Miss Frugality here (again, bags), but there are many things I no longer buy.  So to give a bigger picture of my consumption habits, here are the things I no longer buy:I was never a big sunglasses collection gal, maybe owning about five at the height of my sunglasses collection.  But now I own only one, which I’ve had since 2018.  Sure they’re scratched up as hell but they still work.  And I only got this pair because the one pair before it got stolen.  I like to purchase my sunglasses from Nordstrom Rack (preferably in Hawaii—the Ward location since they always have a large selection), and that’s where I got my current Bottega Veneta ones (come to think of it, this was my first Bottega anything).  I find that having only one pair ensures I never lose it.  And really I just need one good pair.",
        "Comments":[
            {
                "a": "Great"
    
            },
            {
                "a": "Nice Maam"
            }
            
        ]
    },
    {"_id":{"$oid":"66c9a4bb0489ad61b3e068f0"},"catgory":"Bags","Name":"Almina Khan","Email":"alminakhan2@gmail.com","image":"/image/m3.jpeg","heading":"Loewe Mini Hobo Hammock bag Review","content":"Thank you to all those who’ve been patiently waiting for this review of the Loewe Mini Hobo Hammock bag.  As you can see from these photos, I purchased this bag in late Fall and have been using it off and on for about four months now.  I used to have the original Loewe Hammock bag (review of it here), but ended up selling it because I didn’t really use it.  I think I stopped using it because of the way it aged and the fact that the bag is so open.  So how would I compare that to the new Mini Hammock Hobo bag?  I think it’s much better IMHO.First off a note about sizing.  Even though they call this the Mini Hammock Hobo, it’s not that mini (measures 7”H x 10.6”L x 3.7”W).  It’s definitely smaller than the original small hammock bag, but this mini hammock hobo can still fit the essentials and then some.  I usually fit my compact wallet, my bulky sunglasses case, my phone, keys, and some lip balms.  Inside there are no pockets or dividers, just one big open space. {Side note: This bag fits less than the small puzzle tote, which I reviewed here.","Comments":[{"a":"Good"},{"a":"Thanks"}]}
]